[
  {
    "endpoint": "trueskill",
    "title": "<a href=\"https://www.microsoft.com/en-us/research/project/trueskill-ranking-system/\" target=\"_blank\" style=\"display:inline-block; padding:0 0.3em; border-radius:0.2em; text-decoration:none; font-weight:bold;\"><span>Trueskill™</span><i class=\"fa-solid fa-arrow-up-right-from-square\" style=\"font-size:0.95em; color:#fff; margin-left:0.3em;\"></i> <span>by Microsoft Leaderboard</span></a>",
    "description": "<strong>Why We Use TrueSkill™ for Rankings</strong><br><br><ul><li>🏆 Considers both your placement in the round and the ranking of opponents you faced to determine your rank.</li><li>🔄 Adjusts your ranking after every game you play.</li><li>🎮 Used for competitive matchmaking in popular games like Halo, Call of Duty, Gears of War, Forza, Overwatch, Team Fortress 2, and CS:GO.</li><li><i class=\"fa-solid fa-circle-question\" style=\"color:#8bc34a;\"></i> Uncertainty value keeps it fair: new players get a temporary penalty until they have enough rounds for a reliable ranking. It is a standard deviation value from statistics.</li><li>🃏 <strong>Adjusted Ranking:</strong> Your TrueSkill rating minus 3 times your uncertainty. This accounts for TrueSkill's uncertainty about your skill level and creates a fair ranking for players with both few and many rounds played. Your uncertainty goes down with more rounds played.</li></ul><p><strong>Note:</strong> Your TrueSkill score is a <strong>relative skill estimate</strong>, not a point total or winning percentage. A higher rank indicates a stronger player, but it's not a direct measure of any one stat.</p>"
  },
  {
    "endpoint": "percentile",
    "title": "Average Percent Players Outlasted Leaderboard",
    "description": "<p>For every round a player places ahead of a percentage of other players who played that day. This leaderboard measures on average what percentage of players they place ahead of.</p>${getMinimumRoundsDisclaimer()}"
  },
  {
    "endpoint": "roi",
    "title": "Average Simulated (WSOP style) Return On Investment Leaderboard",
    "description": "<p>World Series of Poker (WSOP) style return on investment calculations measure profitability based on theoretical buy-in versus winnings in standard tournament-style payout structure. Example... If you buy in for $100 and your AVG ROI is 30% then on average you will walk out with $130</p>${getMinimumRoundsDisclaimer()}${getNoMoneyDisclaimer()}"
  },
  {
    "endpoint": "firstplace",
    "title": "First Place Leaderboard",
    "description": "<p>Ranks players by their percentage of first place finishes. Shows who has the most tournament wins.</p>${getMinimumRoundsDisclaimer()}"
  },
  {
    "endpoint": "itmpercent",
    "title": "ITM Percent Leaderboard",
    "description": "<p>In The Money (ITM) percentage shows how often a player would finish in a paying position in a standard tournament payout structure. On this leaderboard ITM is defined by finishing in the top 20% of the competition.</p>${getMinimumRoundsDisclaimer()}${getNoMoneyDisclaimer()}"
  },
  {
    "endpoint": "network-graph",
    "title": "Player Network Graph",
    "description": "<p>Network graph visualization showing player connections and performance relationships. Enter a player name below to generate their network graph.</p><div><label for=\"playerNameInput\">Player Name:</label><br><input type=\"text\" id=\"playerNameInput\" placeholder=\"Enter player name (e.g., john f)\"><button onclick=\"generateNetworkGraph()\">Generate Network Graph</button></div><p>This interactive graph displays how players are connected through their game history and performance metrics.</p>"
  },
  {
   "endpoint": "community-disconnectedness",
   "title": "Isolated skill pockets Analysis",
   "description": "<p>This analysis identifies isolated pockets of skill within the player community, highlighting groups of players who may not interact frequently with the broader player base. Understanding these pockets can help in tailoring matchmaking and community engagement strategies.</p>"
  }
]